app/Models/M_admin.php

INSERT INTO `admin` (`nama`, `email`, `password`, `foto`) VALUES ('Alep', 'mangudin067@gmail.com', '$2y$10$9qaRLrFznoaPDaJQqlNn5uOc9QbYurX/o7aDRbfXg2Cr.WVAsxMxy', '1696236757_4b36084af298f412a986.png')
---
    public function add($data)
    {
        $this->db->table('admin')->insert($data);

INSERT INTO `siswa` (`nama`, `instansi`, `jurusan`, `alamat`, `nope`, `id_magang`, `foto`) VALUES ('MUHAMMAD ALIEF SULADEN', 'UIN Raden Fatah Palembang', 'Sistem Informasi', 'Jl.Sultan', '082175654784', '1', '1696237223_a257ae53dfabf1792a66.jpg')
---
    public function addsiswa($data)
    {
        $this->db->table('siswa')->insert($data);

SELECT *
FROM `siswa`
LEFT JOIN `magang` ON `magang`.`id_magang` = `siswa`.`id_magang`
ORDER BY `id_siswa` DESC
---
    public function all_data_siswa()
    {
        return $this->db->table('siswa')
            ->join('magang', 'magang.id_magang = siswa.id_magang', 'left')
            ->orderBy('id_siswa', 'DESC')
            ->get()
            ->getResultArray();

INSERT INTO `magang` (`kelompok`, `waktu_mulai`, `waktu_selesai`, `pengantar`, `proposal`, `divisi`) VALUES ('BSB40CSR', '2023-08-02', '2023-10-26', '1696237120_5603dfa1d3983bf9e6a9.pdf', '1696237120_5603dfa1d3983bf9e6a9.pdf', 'Corporate Social Responsibility (CSR)')
---
    public function addmagang($data)
    {
        $this->db->table('magang')->insert($data);

SELECT *
FROM `magang`
WHERE `id_magang` = '2'
---
    public function detail_magang($id_magang)
    {
        return $this->db->table('magang')
            ->where('id_magang', $id_magang)
            ->get()
            ->getRowArray();

SELECT *
FROM `siswa`
WHERE `id_magang` = '2'
---
    public function get_siswa_by_magang($id_magang)
    {
        return $this->db->table('siswa')
            ->where('id_magang', $id_magang)
            ->get()
            ->getResultArray();

SELECT *
FROM `siswa`
LEFT JOIN `magang` ON `magang`.`id_magang` = `siswa`.`id_magang`
WHERE `id_siswa` = '2'
---
    public function get_siswa($id_siswa)
    {
        return $this->db->table('siswa')
            ->where('id_siswa', $id_siswa)
            ->join('magang', 'magang.id_magang = siswa.id_magang', 'left')
            ->get()
            ->getRowArray();

SELECT `id_siswa`, AVG(disiplin) as rata_disiplin, AVG(sikap) as rata_sikap, AVG(kejujuran) as rata_kejujuran, AVG(kerajinan) as rata_kerajinan, AVG(kerjasama) as rata_kerjasama, AVG(tanggungjawab) as rata_tanggungjawab, AVG(inisiatif) as rata_inisiatif, AVG(kreatifitas) as rata_kreatifitas, AVG(dtp) as rata_dtp, AVG(kualitas) as rata_kualitas
FROM `nilai`
GROUP BY `id_siswa`
---
    public function getAverageNilai()
    {
        $query = $this->db->table('nilai')
            ->select('id_siswa, AVG(disiplin) as rata_disiplin, AVG(sikap) as rata_sikap, AVG(kejujuran) as rata_kejujuran, AVG(kerajinan) as rata_kerajinan, AVG(kerjasama) as rata_kerjasama, AVG(tanggungjawab) as rata_tanggungjawab, AVG(inisiatif) as rata_inisiatif, AVG(kreatifitas) as rata_kreatifitas, AVG(dtp) as rata_dtp, AVG(kualitas) as rata_kualitas')
            ->groupBy('id_siswa')
            ->get();